Table of Contents
 Class ProjectDataEc
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Additional data for Ec project
[OpenModelClass("CI.ProjectData.ProjectDataEc,CI.ProjectData")]
public class ProjectDataEc : OpenObject
Inheritance
object
OpenObject
ProjectDataEc
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AnnexCode
Gets or sets the actual national annex
public NationalAnnexCode AnnexCode { get; set; }
Property Value
NationalAnnexCode
 FatigueAnnexNN
True for check fatigue accorting 1992-2 Annex NN
public bool FatigueAnnexNN { get; set; }
Property Value
bool
 FatigueCheck
To allow fatigue check
public bool FatigueCheck { get; set; }
Property Value
bool
 Edit this page